ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
static bool i2cMasterWaitReady(void)
{
    uint32_t guard = 0;
    while ((I2C_getStatus(I2CB_BASE) & I2C_STS_REG_ACCESS_RDY) == 0U) {
        if (++guard > BTS_I2C_TIMEOUT_ITERATIONS) {
            return false;
        }
        if (I2C_getStatus(I2CB_BASE) & I2C_STS_NO_ACK) {
            I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
            return false;
        }
    }
    return true;
}

//
// Writes a block to the EEPROM at a 16-bit word address.
//
static bool i2cWriteBlock(uint16_t devAddr, uint16_t memAddr,
                          const uint16_t *bytes, uint16_t count)
{
    uint16_t i;

    if (!i2cMasterWaitBusFree()) {
        return false;
    }

    I2C_setTargetAddress(I2CB_BASE, devAddr);
    I2C_setConfig(I2CB_BASE, I2C_CONTROLLER_SEND_MODE);
    I2C_setDataCount(I2CB_BASE, count + 2U);

    I2C_putData(I2CB_BASE, (memAddr >> 8) & 0xFFU);
    I2C_putData(I2CB_BASE, memAddr & 0xFFU);
    I2C_sendStartCondition(I2CB_BASE);

    for (i = 0; i < count; i++) {
        uint32_t guard = 0;
        while ((I2C_getStatus(I2CB_BASE) & I2C_STS_TX_DATA_RDY) == 0U) {
            if (++guard > BTS_I2C_TIMEOUT_ITERATIONS) {
                I2C_sendStopCondition(I2CB_BASE);
                return false;
            }
        }
        I2C_putData(I2CB_BASE, bytes[i] & 0xFFU);
    }

    I2C_sendStopCondition(I2CB_BASE);

    if (!i2cMasterWaitReady()) {
        return false;
    }

    //
    // ARDY only says the module finished its own work; the stop still
    // has to land before the bus belongs to anyone else.
    //
    i2cMasterWaitStopComplete();
    return true;
}

//
// Reads a block from the EEPROM using the usual write-address / restart-read
// sequence.
//
static bool i2cReadBlock(uint16_t devAddr, uint16_t memAddr,
                         uint16_t *bytes, uint16_t count)
{
    uint16_t i;

    if (!i2cMasterWaitBusFree()) {
        return false;
    }

    // Phase 1: write the memory address, no stop (repeated start follows).
    I2C_setTargetAddress(I2CB_BASE, devAddr);
    I2C_setConfig(I2CB_BASE, I2C_CONTROLLER_SEND_MODE);
    I2C_setDataCount(I2CB_BASE, 2U);
    I2C_putData(I2CB_BASE, (memAddr >> 8) & 0xFFU);
    I2C_putData(I2CB_BASE, memAddr & 0xFFU);
    I2C_sendStartCondition(I2CB_BASE);

    if (!i2cMasterWaitReady()) {
        I2C_sendStopCondition(I2CB_BASE);
        return false;
    }

    // Phase 2: repeated start, read count bytes.
    I2C_setConfig(I2CB_BASE, I2C_CONTROLLER_RECEIVE_MODE);
    I2C_setDataCount(I2CB_BASE, count);
    I2C_sendStartCondition(I2CB_BASE);

    for (i = 0; i < count; i++) {
        uint32_t guard = 0;
        while ((I2C_getStatus(I2CB_BASE) & I2C_STS_RX_DATA_RDY) == 0U) {
            if (++guard > BTS_I2C_TIMEOUT_ITERATIONS) {
                I2C_sendStopCondition(I2CB_BASE);
                return false;
            }
            if (I2C_getStatus(I2CB_BASE) & I2C_STS_NO_ACK) {
                I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
                I2C_sendStopCondition(I2CB_BASE);
                return false;
            }
        }
        bytes[i] = I2C_getData(I2CB_BASE) & 0xFFU;
    }

    I2C_sendStopCondition(I2CB_BASE);

    //
    // Let the stop reach the wire before handing the bus on. Returning
    // the moment STP is requested leaves BB set for the next caller,
    // whose setTargetAddress() is then ignored - which is how a
    // perfectly healthy device ends up looking absent.
    //
    i2cMasterWaitStopComplete();
    return true;
}

//
//=============================================================================
// ADS1119 command-protocol helpers
//=============================================================================
//
// The ADS1119 is command-based, not memory-addressed: an access is a single
// command byte, optionally followed by one data byte (WREG) or by a repeated
// start and a read phase (RREG, RDATA). The F-RAM helpers above always emit
// a 16-bit memory address first and so cannot be used here.
//

//
// Writes a command, and optionally its data byte, then stops.
//
//   S  ADDR W A  CMD A  [DATA A]  P
//
// Used for the bare commands (RESET, START/SYNC, POWERDOWN) and for WREG,
// which is the same frame with one payload byte appended.
//
static bool ads1119Write(uint16_t devAddr, uint16_t cmd,
                         const uint16_t *data)
{
    uint16_t count = (data != 0) ? 2U : 1U;
    uint32_t guard;

    if (!i2cMasterWaitBusFree()) {
        return false;
    }

    //
    // One atomic write to I2CMDR starts the frame with the stop already
    // armed, so the module emits it once the byte count reaches zero.
    //
    // The driverlib sequence cannot be used here. It needs three separate
    // writes to get a frame moving, and setting STP in a later one races the
    // transfer: on a one-byte command the frame is torn down before the
    // eighth falling edge of SCL, which is exactly where the ADS1119 latches
    // a command, so the part never sees it. Arming the stop up front is safe
    // because the module honours the byte count first.
    //
    I2C_setTargetAddress(I2CB_BASE, devAddr);
    HWREGH(I2CB_BASE + I2C_O_CNT) = count;

    //
    // The first byte goes in before the frame starts so it is ready the
    // moment the address has been acknowledged.
    //
    I2C_putData(I2CB_BASE, cmd & 0xFFU);

    HWREGH(I2CB_BASE + I2C_O_MDR) = I2C_MDR_FREE | I2C_MDR_STT |
                                    I2C_MDR_STP  | I2C_MDR_MST |
                                    I2C_MDR_TRX  | I2C_MDR_IRS;

    //
    // I2CB runs without its transmit FIFO, so I2CDXR holds exactly one byte:
    // the second one can only be handed over once the first has been taken.
    //
    if (data != 0) {
        guard = 0;
        while ((I2C_getStatus(I2CB_BASE) & I2C_STS_TX_DATA_RDY) == 0U) {
            if (++guard > BTS_I2C_TIMEOUT_ITERATIONS) {
                i2cMasterWaitStopComplete();
                return false;
            }
            if (I2C_getStatus(I2CB_BASE) & I2C_STS_NO_ACK) {
                I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
                i2cMasterWaitStopComplete();
                return false;
            }
        }
        I2C_putData(I2CB_BASE, *data & 0xFFU);
    }

    //
    // Wait for the stop the module was told to send. Neither XRDY nor ARDY
    // can stand in for this: XRDY is already high at the start because
    // I2CDXR is empty, and ARDY is latched and self-clearing, so on frames
    // this short it can set and clear again before the first poll.
    //
    i2cMasterWaitStopComplete();

    //
    // The part latches a command on the eighth falling edge of SCL and then
    // acts on it; starting the next frame immediately can arrive while it is
    // still doing so.
    //
    DEVICE_DELAY_US(50);

    return (I2C_getStatus(I2CB_BASE) & I2C_STS_NO_ACK) == 0U;
}

//
// Sends a bare single-byte command (RESET, START/SYNC, POWERDOWN).
//
static bool ads1119Command(uint16_t devAddr, uint16_t cmd)
{
    return ads1119Write(devAddr, cmd, 0);
}

//
// WREG: writes the single 8-bit configuration register.
//
//   S  ADDR W A  WREG A  DATA A  P
//
static bool ads1119WriteConfig(uint16_t devAddr, uint16_t cfg)
{
    uint16_t value = cfg & 0xFFU;

    return ads1119Write(devAddr, ADS1119_CMD_WREG, &value);
}

//
// Issues a command and reads its response after a repeated start.
//
//   S  ADDR W A  CMD A  Sr  ADDR R A  DATA ... P
//
// Used by RREG (configuration or status) and RDATA.
//
static bool ads1119ReadAfterCommand(uint16_t devAddr, uint16_t cmd,
                                    uint16_t *bytes, uint16_t count)
{
    uint16_t i;
    uint32_t guard;

    if (!i2cMasterWaitBusFree()) {
        return false;
    }

    //
    // Both phases drive I2CMDR with a single write rather than going through
    // I2C_setConfig() / I2C_sendStartCondition() separately.
    //
    // The driverlib helpers issue three writes to get a frame moving, and
    // I2C_setConfig() preserves STT and STP while it does so. On frames this
    // short the transfer can complete between those writes, so the sequence
    // has to be committed atomically or the repeated start below lands on a
    // transaction the module has already finished. These are the exact mode
    // words that were verified working against both converters by hand.
    //
    //   MST | TRX | IRS | FREE | STT        - write phase, no stop
    //   MST |       IRS | FREE | STT | STP  - read phase, stop after N bytes
    //

    //
    // Phase 1: the command byte. No stop - a repeated start follows.
    //
    I2C_setTargetAddress(I2CB_BASE, devAddr);
    HWREGH(I2CB_BASE + I2C_O_CNT) = 1U;
    I2C_putData(I2CB_BASE, cmd & 0xFFU);
    HWREGH(I2CB_BASE + I2C_O_MDR) = I2C_MDR_FREE | I2C_MDR_STT |
                                    I2C_MDR_MST  | I2C_MDR_TRX |
                                    I2C_MDR_IRS;

    //
    // The command has to be on the wire before the repeated start. ARDY is
    // the module's own "ready for the next phase" signal and is the right
    // one here precisely because no stop is involved.
    //
    guard = 0;
    while ((I2C_getStatus(I2CB_BASE) & I2C_STS_REG_ACCESS_RDY) == 0U) {
        if (++guard > BTS_I2C_TIMEOUT_ITERATIONS) {
            I2C_sendStopCondition(I2CB_BASE);
            i2cMasterWaitStopComplete();
            return false;
        }
        if (I2C_getStatus(I2CB_BASE) & I2C_STS_NO_ACK) {
            I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
            I2C_sendStopCondition(I2CB_BASE);
            i2cMasterWaitStopComplete();
            return false;
        }
    }

    //
    // Phase 2: repeated start into a read, with the stop already armed so
    // the module releases the bus itself once the last byte has come in.
    //
    HWREGH(I2CB_BASE + I2C_O_CNT) = count;
    HWREGH(I2CB_BASE + I2C_O_MDR) = I2C_MDR_FREE | I2C_MDR_STT |
                                    I2C_MDR_STP  | I2C_MDR_MST |
                                    I2C_MDR_IRS;

    for (i = 0; i < count; i++) {
        guard = 0;
        while ((I2C_getStatus(I2CB_BASE) & I2C_STS_RX_DATA_RDY) == 0U) {
            if (++guard > BTS_I2C_TIMEOUT_ITERATIONS) {
                I2C_sendStopCondition(I2CB_BASE);
                i2cMasterWaitStopComplete();
                return false;
            }
            if (I2C_getStatus(I2CB_BASE) & I2C_STS_NO_ACK) {
                I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
                I2C_sendStopCondition(I2CB_BASE);
                i2cMasterWaitStopComplete();
                return false;
            }
        }
        bytes[i] = I2C_getData(I2CB_BASE) & 0xFFU;
    }

    //
    // The stop was armed with the read, so just wait for it to land before
    // handing the bus on - leaving BB set makes the next caller's target
    // address write silently ignored.
    //
    i2cMasterWaitStopComplete();
    return true;
}

//
// A C28x byte is 16 bits wide, so the EEPROM image is packed two bytes per
// word. These helpers convert between the packed on-wire form and the
// in-memory struct.
//
#define CAL_EEPROM_BYTES (2U * (uint16_t)sizeof(BTS_channelCalibration))

