ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
static void calibrationToBytes(const BTS_channelCalibration *cal, uint16_t *bytes)
{
    const uint16_t *words = (const uint16_t *)cal;
    uint16_t i;
    for (i = 0; i < (uint16_t)sizeof(BTS_channelCalibration); i++) {
        bytes[i * 2U]      = words[i] & 0xFFU;
        bytes[i * 2U + 1U] = (words[i] >> 8) & 0xFFU;
    }
}

static void bytesToCalibration(const uint16_t *bytes, BTS_channelCalibration *cal)
{
    uint16_t *words = (uint16_t *)cal;
    uint16_t i;
    for (i = 0; i < (uint16_t)sizeof(BTS_channelCalibration); i++) {
        words[i] = (bytes[i * 2U] & 0xFFU) | ((bytes[i * 2U + 1U] & 0xFFU) << 8);
    }
}

bool writeEEPROM(uint16_t channel, const BTS_channelCalibration* data)
{
    uint16_t bytes[CAL_EEPROM_BYTES];
    uint16_t eepromAddr = CAL_FRAM_BASE + channel * CAL_FRAM_STRIDE_BYTES;

    calibrationToBytes(data, bytes);
    return i2cWriteBlock(EEPROM_I2C_ADDR, eepromAddr, bytes, CAL_EEPROM_BYTES);
}

bool readEEPROM(uint16_t channel, BTS_channelCalibration* data)
{
    uint16_t bytes[CAL_EEPROM_BYTES];
    uint16_t eepromAddr = CAL_FRAM_BASE + channel * CAL_FRAM_STRIDE_BYTES;

    if (!i2cReadBlock(EEPROM_I2C_ADDR, eepromAddr, bytes, CAL_EEPROM_BYTES)) {
        return false;
    }
    bytesToCalibration(bytes, data);
    return true;
}

//
// CRC-32 over the struct's words, excluding the trailing crc32 field itself.
// Each 16-bit C28x word contributes its two wire bytes low half first, which
// is the little-endian word order the image is written in.
//
static uint32_t calibrationCrc32(const BTS_channelCalibration *cal)
{
    const uint16_t *words = (const uint16_t *)cal;
    uint16_t nWords = (uint16_t)sizeof(BTS_channelCalibration) - 2U;
    uint32_t crc = 0xFFFFFFFFUL;
    uint16_t i;
    uint16_t b;
    uint16_t bit;

    for (i = 0; i < nWords; i++) {
        for (b = 0; b < 2U; b++) {
            crc ^= (uint32_t)((words[i] >> (b * 8U)) & 0xFFU);
            for (bit = 0; bit < 8U; bit++) {
                crc = (crc & 1UL) ? ((crc >> 1) ^ 0xEDB88320UL) : (crc >> 1);
            }
        }
    }
    return crc ^ 0xFFFFFFFFUL;
}

//
// True when a and b agree to within 0.1 %, used to catch a partially-written
// block through the reciprocal gain pair.
//
static bool calWithinTenth(float32_t a, float32_t b)
{
    float32_t diff = a - b;
    float32_t mag  = (b < 0.0f) ? -b : b;

    if (diff < 0.0f) {
        diff = -diff;
    }
    return (diff <= (mag * 0.001f));
}

//
// A calibration block is valid when the header matches and the channel it
// carries is the one we asked for. The channel lives in the low half of the
// header word rather than being OR-ed into the magic value, which would
// alias for channels >= 4.
//
static bool validateCalibration(const BTS_channelCalibration* cal, uint16_t channel)
{
    if ((cal->header & BTS_CAL_HEADER_MASK) != BTS_CAL_HEADER) {
        return false;
    }
    if ((cal->header & BTS_CAL_CHANNEL_MASK) != (uint32_t)channel) {
        return false;
    }
    if (cal->MinCellTemp < -40.0f || cal->MaxCellTemp > 100.0f || cal->MinCellTemp >= cal->MaxCellTemp) {
        return false;
    }
    if (cal->F28V_Gain < 0.5f || cal->F28V_Gain > 2.0f || cal->F28V_Offset < -1.0f || cal->F28V_Offset > 1.0f) {
        return false;
    }
    if (cal->F28I_Gain < 0.5f || cal->F28I_Gain > 2.0f || cal->F28I_Offset < -2.0f || cal->F28I_Offset > 2.0f) {
        return false;
    }
    //
    // The Iout/Vout gains were not range-checked at all, so a corrupt or
    // half-written block passed straight into the control loop's setpoint
    // arithmetic. Windows derived from the known-good compiled values.
    //
    if (cal->IoutGain_pu < 0.05f || cal->IoutGain_pu > 0.20f) {
        return false;
    }
    if (cal->VoutGain_pu < 0.10f || cal->VoutGain_pu > 0.40f) {
        return false;
    }
    //
    // The pu and engineering gains are a reciprocal pair. Disagreement means
    // a partially-written block, whatever the individual values look like.
    //
    if (cal->IoutGain_A == 0.0f || cal->VoutGain_V == 0.0f) {
        return false;
    }
    if (!calWithinTenth(1.0f / cal->IoutGain_pu, cal->IoutGain_A)) {
        return false;
    }
    if (!calWithinTenth(1.0f / cal->VoutGain_pu, cal->VoutGain_V)) {
        return false;
    }
    if (cal->crc32 != calibrationCrc32(cal)) {
        return false;
    }
    return true;
}

static bool validateGlobalVoltages(void)
{
    float chargeDisableV = registers[BTS_REG_IDX(eChargeDisableV)];
    float chargeRestrictV = registers[BTS_REG_IDX(eChargeRestrictV)];
    float dischargeRestrictV = registers[BTS_REG_IDX(eDischargeRestrictV)];
    float dischargeDisableV = registers[BTS_REG_IDX(eDischargeDisableV)];

    return (chargeDisableV >= MIN_VOLTAGE &&
            chargeDisableV <= chargeRestrictV &&
            chargeRestrictV <= dischargeRestrictV &&
            dischargeRestrictV <= dischargeDisableV &&
            dischargeDisableV <= MAX_VOLTAGE);
}

//
//=============================================================================
// CPU2 -> CPU1 notification
//=============================================================================
//
// registers[] lives in CPU2TOCPU1RAM and is written here before the flag is
// raised, so CPU1 sees a settled value. These are non-blocking: if the
// previous flag has not been acknowledged yet the notification is skipped,
// because CPU1 re-reads the affected block from registers[] anyway.
//
static void notifyCpu1RegisterWrite(uint16_t regIdx, float32_t value)
{
    if (IPC_isFlagBusyLtoR(IPC_CPU2_L_CPU1_R, BTS_IPC_FLAG_REG_WRITE)) {
        return;
    }
    ipcMsg.regAddr = regIdx;
    ipcMsg.value = value;
    IPC_setFlagLtoR(IPC_CPU2_L_CPU1_R, BTS_IPC_FLAG_REG_WRITE);
}

//
// Signals that every channel's calibration has been rewritten. CPU1 responds
// by reloading all channels and recalculating its program variables.
//
static void notifyCpu1CalibrationReload(void)
{
    IPC_setFlagLtoR(IPC_CPU2_L_CPU1_R, BTS_IPC_FLAG_CAL_RELOAD);
}

//
// Installs the compiled-in defaults for one channel.
//
static void applyDefaultCalibration(uint16_t ch)
{
    uint16_t tempBase = BTS_TEMP_BASE(ch);
    uint16_t calBase  = BTS_CAL_BASE(ch);

    registers[tempBase + BTS_TEMP_MIN] = DEFAULT_MIN_CELL_TEMP;
    registers[tempBase + BTS_TEMP_MAX] = DEFAULT_MAX_CELL_TEMP;

