ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
        for (i = 0; i < 8U; i++) {
            voltageBytes[i * 2U]      = src[i] & 0xFFU;
            voltageBytes[i * 2U + 1U] = (src[i] >> 8) & 0xFFU;
        }
        i2cWriteBlock(EEPROM_I2C_ADDR, EEPROM_GLOBAL_V_ADDR, voltageBytes, 16U);
    }

    return written;
}

void saveCalibration(uint16_t channel)
{
    (void)saveCalibrationFlags(channel, 0UL);
}

//
// Commits every channel to EEPROM. Triggered by a host writing
// eCalibrationMode = 2.
//
static void saveAllCalibration(void)
{
    uint16_t ch;
    for (ch = 0; ch < NUM_CHANNELS; ch++) {
        saveCalibration(ch);
    }
}

//
//=============================================================================
// Slot runtime state persistence
//=============================================================================
//
// Same word-pair packing as the calibration image: a C28x "byte" is 16 bits,
// so each struct word contributes its two wire bytes low half first.
//
#define STATE_EEPROM_BYTES (2U * (uint16_t)sizeof(BTS_slotRuntimeState))

//
// Same generator and seed as calibrationCrc32(), over a different struct.
//
static uint32_t slotStateCrc32(const BTS_slotRuntimeState *st)
{
    const uint16_t *words = (const uint16_t *)st;
    uint16_t nWords = (uint16_t)sizeof(BTS_slotRuntimeState) - 2U;
    uint32_t crc = 0xFFFFFFFFUL;
    uint16_t i;
    uint16_t b;
    uint16_t bit;

    for (i = 0; i < nWords; i++) {
        for (b = 0; b < 2U; b++) {
            crc ^= (uint32_t)((words[i] >> (b * 8U)) & 0xFFU);
            for (bit = 0; bit < 8U; bit++) {
                crc = (crc & 1UL) ? ((crc >> 1) ^ 0xEDB88320UL) : (crc >> 1);
            }
        }
    }
    return crc ^ 0xFFFFFFFFUL;
}

static bool writeSlotState(uint16_t channel, const BTS_slotRuntimeState *st)
{
    uint16_t bytes[STATE_EEPROM_BYTES];
    const uint16_t *words = (const uint16_t *)st;
    uint16_t addr = STATE_FRAM_BASE + channel * STATE_FRAM_STRIDE;
    uint16_t i;

    for (i = 0; i < (uint16_t)sizeof(BTS_slotRuntimeState); i++) {
        bytes[i * 2U]      = words[i] & 0xFFU;
        bytes[i * 2U + 1U] = (words[i] >> 8) & 0xFFU;
    }
    return i2cWriteBlock(EEPROM_I2C_ADDR, addr, bytes, STATE_EEPROM_BYTES);
}

static bool readSlotState(uint16_t channel, BTS_slotRuntimeState *st)
{
    uint16_t bytes[STATE_EEPROM_BYTES];
    uint16_t *words = (uint16_t *)st;
    uint16_t addr = STATE_FRAM_BASE + channel * STATE_FRAM_STRIDE;
    uint16_t i;

    if (!i2cReadBlock(EEPROM_I2C_ADDR, addr, bytes, STATE_EEPROM_BYTES)) {
        return false;
    }
    for (i = 0; i < (uint16_t)sizeof(BTS_slotRuntimeState); i++) {
        words[i] = (bytes[i * 2U] & 0xFFU) | ((bytes[i * 2U + 1U] & 0xFFU) << 8);
    }
    return true;
}

static bool validateSlotState(const BTS_slotRuntimeState *st, uint16_t channel)
{
    if ((st->header & BTS_STATE_HEADER_MASK) != BTS_STATE_HEADER) {
        return false;
    }
    if ((st->header & BTS_STATE_CHANNEL_MASK) != (uint32_t)channel) {
        return false;
    }
    return (st->crc32 == slotStateCrc32(st));
}

//
// Per-slot save counter, kept across saves so a host can tell a fresh record
// from a stale one and see how much writing the block has taken.
//
static uint32_t slotStateSaveCounter[NUM_CHANNELS];

//
// Composes and writes one slot's record from the register file. Called only
// from BTS_serviceDeferredWork() - F-RAM is never written from an ISR.
//
static bool saveSlotState(uint16_t channel)
{
    BTS_slotRuntimeState st;
    uint16_t rtBase = BTS_RT_BASE(channel);
    uint32_t bits   = (uint32_t)registers[rtBase + BTS_RT_STATUS];
    uint32_t flags  = 0UL;

    //
    // A paused slot is saved as running in its held direction: that is what
    // the restore has to reconstruct, and it is what a power cut mid-pause
    // should come back as.
    //
    if ((bits & (1UL << BTS_STATUS_RUNNING)) != 0UL) {
        flags |= BTS_STATE_F_RUNNING;
        if ((bits & (1UL << BTS_STATUS_CHARGING)) != 0UL) {
            flags |= BTS_STATE_F_CHARGING;
        }
    }
    if ((bits & (1UL << BTS_STATUS_END)) != 0UL) {
        flags |= BTS_STATE_F_END;
    }

    st.header           = BTS_STATE_MAKE_HEADER(channel);
    st.stateFlags       = flags;
    st.chargeMah        = registers[rtBase + BTS_RT_CHARGE_MAH];
    st.chargeMwh        = registers[rtBase + BTS_RT_CHARGE_MWH];
    st.chargeSeconds    = registers[rtBase + BTS_RT_CHARGE_SECONDS];
    st.dischargeMah     = registers[rtBase + BTS_RT_DISCHARGE_MAH];
    st.dischargeMwh     = registers[rtBase + BTS_RT_DISCHARGE_MWH];
    st.dischargeSeconds = registers[rtBase + BTS_RT_DISCHARGE_SECONDS];
    st.saveCounter      = ++slotStateSaveCounter[channel];
    st.crc32            = slotStateCrc32(&st);

    return writeSlotState(channel, &st);
}

//
// Boot restore. Populates the runtime counters and supervision.restoreFlags,
// then raises one IPC flag once the whole file is consistent - the same
// discipline as the calibration reload, not one flag per slot.
//
// An absent or invalid record is the normal first-boot case: the slot starts
// STOPPED with zeroed counters and nothing is logged.
//
static void loadSlotStates(void)
{
    uint32_t restoreFlags = 0UL;
    uint16_t ch;

    for (ch = 0; ch < NUM_CHANNELS; ch++) {
        BTS_slotRuntimeState st;
        uint16_t rtBase = BTS_RT_BASE(ch);

        if (readSlotState(ch, &st) && validateSlotState(&st, ch)) {
            registers[rtBase + BTS_RT_CHARGE_MAH]        = st.chargeMah;
            registers[rtBase + BTS_RT_CHARGE_MWH]        = st.chargeMwh;
            registers[rtBase + BTS_RT_CHARGE_SECONDS]    = st.chargeSeconds;
            registers[rtBase + BTS_RT_DISCHARGE_MAH]     = st.dischargeMah;
            registers[rtBase + BTS_RT_DISCHARGE_MWH]     = st.dischargeMwh;
            registers[rtBase + BTS_RT_DISCHARGE_SECONDS] = st.dischargeSeconds;

            slotStateSaveCounter[ch] = st.saveCounter;
            restoreFlags |= (st.stateFlags & BTS_STATE_FLAGS_MASK)
                            << BTS_STATE_FLAGS_SHIFT(ch);
        } else {
            registers[rtBase + BTS_RT_CHARGE_MAH]        = 0.0f;
            registers[rtBase + BTS_RT_CHARGE_MWH]        = 0.0f;
            registers[rtBase + BTS_RT_CHARGE_SECONDS]    = 0.0f;
            registers[rtBase + BTS_RT_DISCHARGE_MAH]     = 0.0f;
            registers[rtBase + BTS_RT_DISCHARGE_MWH]     = 0.0f;
            registers[rtBase + BTS_RT_DISCHARGE_SECONDS] = 0.0f;
            slotStateSaveCounter[ch] = 0UL;
        }
    }

    supervision.restoreFlags = restoreFlags;
    IPC_setFlagLtoR(IPC_CPU2_L_CPU1_R, BTS_IPC_FLAG_STATE_RESTORE);
}

void initCAN(void)
{
    //
    // CANA pins (GPIO30 = RX, GPIO31 = TX) muxed by CPU1.
    //
    CAN_initModule(CANA_BASE);
    CAN_setBitRate(CANA_BASE, DEVICE_SYSCLK_FREQ, CAN_BITRATE, 16);
    CAN_enableInterrupt(CANA_BASE, CAN_INT_IE0 | CAN_INT_ERROR | CAN_INT_STATUS);
    Interrupt_register(INT_CANA0, &canISR);
    Interrupt_enable(INT_CANA0);

