ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
    for (uint16_t i = 0; i < NUM_CHANNELS; i++) {
        CAN_setupMessageObject(CANA_BASE, i + 1, CAN_MSG_ID_BASE | ((uint32_t)i << 20) | 0x01,
                               CAN_MSG_FRAME_EXT, CAN_MSG_OBJ_TYPE_TX, 0,
                               CAN_MSG_OBJ_NO_FLAGS, 8);
    }
    CAN_setupMessageObject(CANA_BASE, 9, CAN_MSG_ID_BASE | 0x02, CAN_MSG_FRAME_EXT,
                           CAN_MSG_OBJ_TYPE_RX, 0x1FFFFFFF,
                           CAN_MSG_OBJ_RX_INT_ENABLE, 8);

    CAN_startModule(CANA_BASE);
}

void sendCANData(uint16_t channel)
{
    uint16_t data[8];
    const uint16_t *v;
    const uint16_t *c;

    if (channel >= NUM_CHANNELS) return;

    v = (const uint16_t *)&canData[channel].voltage;
    c = (const uint16_t *)&canData[channel].current;

    data[0] = canData[channel].channel & 0xFFU;
    data[1] = 0;
    data[2] = v[0] & 0xFFU;
    data[3] = (v[0] >> 8) & 0xFFU;
    data[4] = v[1] & 0xFFU;
    data[5] = (v[1] >> 8) & 0xFFU;
    data[6] = c[0] & 0xFFU;
    data[7] = (c[0] >> 8) & 0xFFU;

    CAN_sendMessage(CANA_BASE, channel + 1, 8, data);
}

volatile uint16_t sfraEnabled = 0;

void initUART(void)
{
#if (BTS_CONSOLE_ENABLED == true)
    //
    // Present only in a debug build (BTS_DEBUG_CONSOLE): the AT console
    // runs on SCIA (GPIO28/29), reaching the controlCARD's isolated FTDI
    // backchannel over the same USB cable as the debug probe.
    //
    //
    // Console pins (GPIO28/29) muxed by CPU1.
    //
    SCI_setConfig(BTS_CONSOLE_SCI_BASE, DEVICE_LSPCLK_FREQ, BTS_CONSOLE_BAUDRATE,
                  (SCI_CONFIG_WLEN_8 | SCI_CONFIG_STOP_ONE | SCI_CONFIG_PAR_NONE));
    SCI_resetChannels(BTS_CONSOLE_SCI_BASE);
    SCI_enableFIFO(BTS_CONSOLE_SCI_BASE);
    SCI_enableModule(BTS_CONSOLE_SCI_BASE);
    SCI_performSoftwareReset(BTS_CONSOLE_SCI_BASE);

    //
    // With the FIFO enabled the receiver raises RXFFINT, not RXRDY - enabling
    // SCI_INT_RXRDY_BRKDT here sets RXBKINTENA, which never fires in FIFO
    // mode, so characters pile up until the FIFO overflows and no ISR runs.
    // Interrupt after every character so AT commands are processed promptly.
    //
    SCI_setFIFOInterruptLevel(BTS_CONSOLE_SCI_BASE, SCI_FIFO_TX16, SCI_FIFO_RX1);
    SCI_enableInterrupt(BTS_CONSOLE_SCI_BASE, SCI_INT_RXFF);
    SCI_clearInterruptStatus(BTS_CONSOLE_SCI_BASE, SCI_INT_RXFF);

    Interrupt_register(BTS_CONSOLE_RX_INT, &uartRxISR);
    Interrupt_enable(BTS_CONSOLE_RX_INT);
#else
    //
    // Production build: GPIO29 drives the WS2812B LED string and GPIO28 is
    // channel 1's trip input, so no console port exists. The host talks to
    // the unit over I2C or CAN instead.
    //
#endif
}

void initTimer(void)
{
    CPUTimer_setPeriod(CPUTIMER1_BASE, DEVICE_SYSCLK_FREQ / 8);
    CPUTimer_setPreScaler(CPUTIMER1_BASE, 0);
    CPUTimer_enableInterrupt(CPUTIMER1_BASE);
    Interrupt_register(INT_TIMER1, &timerISR);
    Interrupt_enable(INT_TIMER1);
    CPUTimer_startTimer(CPUTIMER1_BASE);
}

//
// Brings one converter up, following the start-up sequence in the ADS1119
// datasheet (section 9.2.2): RESET, WREG, optional RREG sanity check, then
// START/SYNC to begin converting continuously.
//
// Returns true if the converter acknowledged and read back the configuration
// it was given. A false return means the part is absent or unreachable; its
// DRDY interrupt is then left masked rather than costing a full set of I2C
// timeouts on every edge.
//
static bool ads1119Start(uint16_t devAddr)
{
    uint16_t cfg = ADS1119_CFG_FOR_CH(0U);
    uint16_t readback = 0;

    //
    // Reset first so the part is in a known state regardless of what the
    // shared RESET1/RESET2 line did earlier.
    //
    if (!ads1119Command(devAddr, ADS1119_CMD_RESET)) {
        return false;
    }

    //
    // The datasheet gives no explicit recovery time for the RESET command,
    // but the power-on reset takes around 500 us to release. Give the part
    // the same margin before configuring it: a WREG that lands while the
    // reset is still settling is accepted on the bus and then discarded,
    // which reads back as 00h and looks exactly like a missing device.
    //
    DEVICE_DELAY_US(1000);

    if (!ads1119WriteConfig(devAddr, cfg)) {
        return false;
    }

    //
    // The part has no ID register, so reading the configuration back is the
    // identification. Distinguish the two ways this can fail, because they
    // mean very different things on the bench.
    //
    if (!ads1119ReadAfterCommand(devAddr, ADS1119_CMD_RREG_CFG, &readback, 1U)) {
        return false;
    }

    if ((readback & 0xFFU) != (cfg & 0xFFU)) {
        //
        // It answered but did not keep the configuration. Retry once: the
        // usual cause is a WREG that raced the reset above.
        //
        if (!ads1119WriteConfig(devAddr, cfg)) {
            return false;
        }
        if (!ads1119ReadAfterCommand(devAddr, ADS1119_CMD_RREG_CFG,
                                     &readback, 1U)) {
            return false;
        }
        if ((readback & 0xFFU) != (cfg & 0xFFU)) {
            return false;
        }
    }

    //
    // CM = 1 alone does not start anything. Continuous conversion begins
    // only on START/SYNC, which must be re-issued whenever CM changes.
    //
    return ads1119Command(devAddr, ADS1119_CMD_START);
}

void initADS1119(void)
{
    //
    // Free-running timebase for the settling delay between channels.
    //
    // CPU timer 0 is otherwise only started by the WS2812B driver, which
    // is compiled out in a console build, so start it here and let it run
    // with no interrupt. Only the counter is read.
    //
    CPUTimer_setPeriod(CPUTIMER0_BASE, 0xFFFFFFFFUL);
    CPUTimer_setPreScaler(CPUTIMER0_BASE, 0U);
    CPUTimer_disableInterrupt(CPUTIMER0_BASE);
    CPUTimer_startTimer(CPUTIMER0_BASE);

    bool ok1;
    bool ok2;

    //
    // Pins and interrupt routing first, but the interrupts themselves stay
    // masked: the DRDY ISRs perform blocking I2C transfers, so one firing
    // during the configuration writes below would deadlock against the
    // transfer already in progress.
    //
    //
    // DRDY pins (GPIO42/43) are configured as GPIO inputs by CPU1. The XINT
    // routing and edge selection are not pin-mux registers, so CPU2 sets
    // those itself.
    //
    GPIO_setInterruptPin(ADS1119_DRDY_GPIO_1, GPIO_INT_XINT1);
    GPIO_setInterruptType(GPIO_INT_XINT1, GPIO_INT_TYPE_FALLING_EDGE);
    GPIO_setInterruptPin(ADS1119_DRDY_GPIO_2, GPIO_INT_XINT2);
    GPIO_setInterruptType(GPIO_INT_XINT2, GPIO_INT_TYPE_FALLING_EDGE);

    Interrupt_register(INT_XINT1, &ads1119Drdy1ISR);
    Interrupt_register(INT_XINT2, &ads1119Drdy2ISR);

    //
    // Configure both converters for channel 0 and start them converting.
    // CPU1 pulses the shared RESET1/RESET2 lines during its own start-up,
    // well before it releases CPU2, so the reset cannot land after these
    // writes and silently return the configuration register to 00h.
    //
    ok1 = ads1119Start(ADS1119_ADDR_1);
    ok2 = ads1119Start(ADS1119_ADDR_2);

    currentAdsChannel[0] = 0U;
    currentAdsChannel[1] = 0U;
    adsFailCount[0] = ok1 ? 0U : ADS1119_MAX_CONSECUTIVE_FAILURES;
    adsFailCount[1] = ok2 ? 0U : ADS1119_MAX_CONSECUTIVE_FAILURES;

#if (BTS_CONSOLE_ENABLED == true)
    uartSendResponse(ok1 ? "ADS1119 @0x40 ok" : "ADS1119 @0x40 not found");
    uartSendResponse(ok2 ? "ADS1119 @0x41 ok" : "ADS1119 @0x41 not found");
#endif

    //
    // Now the bus is idle, accept DRDY. Clear anything the PIE latched while
    // the converters were being configured, otherwise a stale edge fires the
    // ISR immediately and it contends with this still-unfinished init.
    //
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP1);

    if (ok1) {
        GPIO_enableInterrupt(GPIO_INT_XINT1);
        Interrupt_enable(INT_XINT1);
    }
    if (ok2) {
        GPIO_enableInterrupt(GPIO_INT_XINT2);
        Interrupt_enable(INT_XINT2);
    }
}

