ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
float mVToTemperature(float mV)
{
    float v = mV * (float)0.001;
    float t;

    //
    // No low-end rejection. The amplifier holds its output above ground, so
    // the fit bottoms out at +18.3 C for 0 V in - there is no input voltage
    // that produces a nonsensically low temperature, and a reading of a few
    // tens of millivolts is a genuine measurement just under 19 C rather
    // than a sign of a missing sensor.
    //
    // Negative inputs are the one exception: the converter is bipolar, so a
    // negative code means the input went below AGND, which the conditioning
    // cannot legitimately produce.
    //
    if (v < (float)0.0) {
        v = (float)0.0;
    }

    //
    // The top of the amplifier range sits above the converter full scale, so
    // a reading cannot legitimately exceed it. Clamp rather than reject:
    // this end is a genuine over-temperature, not a wiring fault.
    //
    if (v > BTS_NTC_V_MAX) {
        v = BTS_NTC_V_MAX;
    }

    //
    // Horner's method - four multiply-adds rather than building the powers.
    //
    t = BTS_NTC_POLY_C4;
    t = t * v + BTS_NTC_POLY_C3;
    t = t * v + BTS_NTC_POLY_C2;
    t = t * v + BTS_NTC_POLY_C1;
    t = t * v + BTS_NTC_POLY_C0;

    return t;
}

float readADS1119Data(uint16_t adsAddr, uint16_t channel)
{
    uint16_t data[2];
    int16_t raw;
    float mV;
    uint16_t unit = (adsAddr == ADS1119_ADDR_1) ? 0U : 1U;

    (void)channel;

    //
    // RDATA, then a repeated start and two bytes MSB first.
    //
    if (!ads1119ReadAfterCommand(adsAddr, ADS1119_CMD_RDATA, data, 2U)) {
        //
        // No response. Give up on this converter after a run of failures so a
        // missing device cannot monopolise the CPU.
        //
        if (adsFailCount[unit] < ADS1119_MAX_CONSECUTIVE_FAILURES) {
            adsFailCount[unit]++;
            if (adsFailCount[unit] >= ADS1119_MAX_CONSECUTIVE_FAILURES) {
                GPIO_disableInterrupt((unit == 0U) ? GPIO_INT_XINT1
                                                   : GPIO_INT_XINT2);
            }
        }
        return 0.0f;
    }

    adsFailCount[unit] = 0;

    //
    // Bipolar 16-bit result against the external 2.50 V reference on
    // REFP/REFN, not the internal 2.048 V.
    //
    raw = (int16_t)(((data[0] & 0xFFU) << 8) | (data[1] & 0xFFU));
    mV = ((float)raw * ADS1119_VREF_MV) / ADS1119_FULL_SCALE;

    return mVToTemperature(mV);
}

//
// Points the converter's multiplexer at the next thermistor. Writing the
// configuration register restarts the conversion by itself, so no further
// START/SYNC is needed here.
//
void configureNextChannel(uint16_t adsAddr, uint16_t nextChannel)
{
    ads1119WriteConfig(adsAddr, ADS1119_CFG_FOR_CH(nextChannel));
}

//
// Publishes one channel's measured temperature.
//
// This goes to eChX_CellTemp (RO), NOT to the min/max pair at 512: that pair
// is the configured trip window, is mirrored into the F-RAM calibration
// image, and writing a measurement over it destroys the configuration.
//
// A failed read is left out of the register file entirely rather than
// published as 0.0 degrees C, which would read as a plausible temperature.
//
static void publishCellTemp(uint16_t channel, float temp, bool valid)
{
    if (!valid) {
        return;
    }

    registers[BTS_CELLTEMP_IDX(channel)] = temp;

    //
    // Advisory to CPU1's control loops; the value is already settled in
    // registers[] before the flag is raised. Non-blocking: if the previous
    // notification has not been acknowledged the update is simply skipped,
    // since CPU1 re-reads the register anyway.
    //
    if (!IPC_isFlagBusyLtoR(IPC_CPU2_L_CPU1_R, BTS_IPC_FLAG_TEMP_UPDATE)) {
        IPC_setFlagLtoR(IPC_CPU2_L_CPU1_R, BTS_IPC_FLAG_TEMP_UPDATE);
    }
}

//
//=============================================================================
// Background temperature acquisition
//=============================================================================
//
// The converters are serviced from the main loop, not from the DRDY
// interrupts. An I2C transfer at 400 kHz takes tens of microseconds, and the
// old code ran a whole RDATA frame plus a reconfiguration write inside the
// ISR with spin-waits throughout. That starved everything else on this core:
// the AT console dropped characters and the I2CA slave could not answer the
// host while a conversion was being collected.
//
// Now a DRDY edge only records that a result is waiting. BTS_serviceADS1119()
// performs one short, non-blocking step per call from the idle loop, so the
// bus is driven continuously in the background while the interrupts stay
// trivially short.
//
typedef enum {
    eAdsIdle = 0,       // waiting for DRDY
    eAdsReadCmd,        // RDATA command frame issued
    eAdsReadData,       // collecting the two result bytes
    eAdsSetMux,         // starting the WREG frame for the next channel
    eAdsMuxDone,        // waiting for the WREG frame to complete
    eAdsStart,          // re-arming conversions after the mux change
    eAdsStartDone,      // waiting for the START/SYNC frame to finish
    eAdsSettle,         // letting the new channel settle
} BTS_adsState;

static volatile BTS_adsState adsState[2]   = {eAdsIdle, eAdsIdle};
static volatile uint16_t     adsPending[2] = {0U, 0U};
static uint16_t              adsRxBytes[2][2];
static uint16_t              adsRxCount[2] = {0U, 0U};
static uint32_t              adsGuard[2]   = {0U, 0U};
static uint32_t              adsDwellStart[2] = {0U, 0U};
static uint16_t              adsSampleCh[2] = {0U, 0U};

//
// Bound on how many service calls one transfer phase may occupy before it is
// abandoned. The idle loop calls in continuously, so this is a generous
// ceiling that only trips on genuinely stuck hardware.
//
#define ADS1119_PHASE_MAX_POLLS  2000UL

//
// Poll bound for the one byte handed over inside the WREG frame. A byte
// at 400 kHz is about 22 us, so this is generous while staying far
// below the 55 ms interface timeout of the part.
//
#define ADS1119_WREG_BYTE_TIMEOUT  20000UL

//
// Service calls to dwell on a channel after switching the mux. The idle
// loop calls in continuously, so this is a coarse delay rather than a
// calibrated one - it only has to be long enough that the reading
// belongs to the new channel.
//
//
// Settling time after a mux change, in SYSCLK counts.
//
// This has to outlast one full conversion so the result that follows was
// started on the new input. At 20 SPS a conversion is 50 ms, so allow 60.
// Counting service calls instead of time does not work: a call is a few
// instructions at 160 MHz, so the loop races the converter and publishes
// whatever was already in the output register.
//
#define ADS1119_SETTLE_US        (60000UL)
#define ADS1119_SETTLE_COUNTS    ((uint32_t)(ADS1119_SETTLE_US) * (uint32_t)(DEVICE_SYSCLK_FREQ / 1000000U))

