ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
    case eAdsSetMux:
        //
        // The read armed its own stop, so wait for the bus to clear before
        // starting the configuration frame.
        //
        if (I2C_isBusBusy(I2CB_BASE)) {
            if (++adsGuard[unit] > ADS1119_PHASE_MAX_POLLS) {
                ads1119Abort(unit);
            }
            return;
        }

        adsGuard[unit] = 0U;

        //
        // WREG is command byte plus data byte, and both have to go out inside
        // one frame without a gap.
        //
        // The part resets its own I2C interface if a host starts a command
        // and then stalls for 14000 tMOD - about 55 ms at the 256 kHz
        // modulator. It also NACKs the trailing byte when that happens. So
        // the two bytes are pushed back to back here, with only the short
        // wait for I2CDXR to drain in between, rather than being split
        // across service calls where an interrupt could open a gap.
        //
        // The wait is for one byte at 400 kHz, roughly 22 us. That is long
        // by ISR standards but trivial next to the 50 ms budget, and it is
        // the only way to keep the frame contiguous without a transmit FIFO.
        //
        {
            uint16_t cfg = ADS1119_CFG_FOR_CH(currentAdsChannel[unit]);
            uint32_t guard = 0;

            I2C_setTargetAddress(I2CB_BASE, devAddr);
            HWREGH(I2CB_BASE + I2C_O_CNT) = 2U;
            I2C_putData(I2CB_BASE, ADS1119_CMD_WREG);
            HWREGH(I2CB_BASE + I2C_O_MDR) = I2C_MDR_FREE | I2C_MDR_STT |
                                            I2C_MDR_STP  | I2C_MDR_MST |
                                            I2C_MDR_TRX  | I2C_MDR_IRS;

            while ((I2C_getStatus(I2CB_BASE) & I2C_STS_TX_DATA_RDY) == 0U) {
                if (++guard > ADS1119_WREG_BYTE_TIMEOUT) {
                    ads1119Abort(unit);
                    return;
                }
                if (I2C_getStatus(I2CB_BASE) & I2C_STS_NO_ACK) {
                    I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
                    ads1119Abort(unit);
                    return;
                }
            }

            I2C_putData(I2CB_BASE, cfg & 0xFFU);
        }

        //
        // Let the WREG frame finish before anything else touches the bus.
        //
        // The stop was armed with the frame, so the module emits it once
        // the byte count reaches zero. Moving straight on would start the
        // next frame on top of this one: the START/SYNC that follows
        // truncates the configuration write, the MUX field never takes
        // effect, and every channel keeps sampling AIN0 while the code
        // believes it is cycling.
        //
        adsState[unit] = eAdsMuxDone;
        return;

    case eAdsMuxDone:
        if (I2C_isBusBusy(I2CB_BASE)) {
            if (++adsGuard[unit] > ADS1119_PHASE_MAX_POLLS) {
                ads1119Abort(unit);
            }
            return;
        }

        if (status & I2C_STS_NO_ACK) {
            I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
            ads1119Abort(unit);
            return;
        }

        adsGuard[unit] = 0U;

        adsState[unit] = eAdsStart;
        return;

    case eAdsStart:
        //
        // Re-arm conversions after the mux change.
        //
        // Writing the configuration register restarts an ongoing
        // conversion by itself, so in steady state this is redundant.
        // It matters on the edges: if the part has fallen back to its
        // reset defaults - single-shot mode - nothing else would ever
        // start it converting again, and the channel would read zero
        // forever with no error anywhere to show why.
        //
        if (I2C_isBusBusy(I2CB_BASE)) {
            if (++adsGuard[unit] > ADS1119_PHASE_MAX_POLLS) {
                ads1119Abort(unit);
            }
            return;
        }

        adsGuard[unit] = 0U;

        I2C_setTargetAddress(I2CB_BASE, devAddr);
        HWREGH(I2CB_BASE + I2C_O_CNT) = 1U;
        I2C_putData(I2CB_BASE, ADS1119_CMD_START);
        HWREGH(I2CB_BASE + I2C_O_MDR) = I2C_MDR_FREE | I2C_MDR_STT |
                                        I2C_MDR_STP  | I2C_MDR_MST |
                                        I2C_MDR_TRX  | I2C_MDR_IRS;

        //
        // Like the WREG above, this frame has to be allowed to finish.
        // The dwell that follows is counted in service calls, not bus
        // time, so without waiting here the next read would start on top
        // of this one.
        //
        adsState[unit] = eAdsStartDone;
        return;

    case eAdsStartDone:
        if (I2C_isBusBusy(I2CB_BASE)) {
            if (++adsGuard[unit] > ADS1119_PHASE_MAX_POLLS) {
                ads1119Abort(unit);
            }
            return;
        }

        if (status & I2C_STS_NO_ACK) {
            I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
            ads1119Abort(unit);
            return;
        }

        adsGuard[unit] = 0U;

        //
        // Hold this channel for a while before moving on. The conversion
        // itself settles in one 20 SPS period, but the analogue front end
        // is slower than the converter and cell temperature does not move
        // quickly - dwelling here gives the reading time to be real rather
        // than a smear of the previous channel.
        //
        adsDwellStart[unit] = CPUTimer_getTimerCount(CPUTIMER0_BASE);
        adsState[unit]  = eAdsSettle;
        return;

    case eAdsSettle:
        //
        // Wait out the dwell, then require a completely fresh conversion.
        //
        // The dwell alone is not enough: DRDY keeps asserting throughout it,
        // so whatever is pending the moment it expires may still be the
        // conversion that was already in flight when the mux moved. Clearing
        // the pending flag at the end and waiting for the next edge
        // guarantees the sample that gets published started after the new
        // channel was selected.
        //
        // START/SYNC restarted the converter, so the first result arrives one
        // conversion period later - 50 ms at 20 SPS.
        //
        {
            //
            // CPU timer 0 counts down, so elapsed time is start - now,
            // and the subtraction wraps correctly on reload.
            //
            uint32_t now     = CPUTimer_getTimerCount(CPUTIMER0_BASE);
            uint32_t elapsed = adsDwellStart[unit] - now;

            if (elapsed < ADS1119_SETTLE_COUNTS) {
                adsPending[unit] = 0U;  // ignore results from the old input
                return;
            }
        }

        //
        // Settled. The mux now points at currentAdsChannel, so that is
        // the input the next conversion measures - record it as the
        // channel this result will be credited to.
        //
        adsSampleCh[unit] = currentAdsChannel[unit];
        adsState[unit]    = eAdsIdle;
        return;

    default:
        adsState[unit] = eAdsIdle;
        return;
    }
}

//
// Drives both converters. Called from the idle loop; performs at most one
// step per converter per call and never waits on the bus.
//
void BTS_serviceADS1119(void)
{
    ads1119Service(0U);
    ads1119Service(1U);
}

//
// Runtime calibration save handshake. CPU1 computes and validates the
// two-point result, then bumps calSaveSeq; this side notices the change and
// defers the F-RAM write to the idle loop, exactly as the eCalibrationMode
// commit does. Nothing here may touch the F-RAM - mirrorCpu1Status() runs
// inside timerISR.
//
static volatile uint16_t calRuntimeSavePending = 0U;
static volatile uint16_t calRuntimeSaveSlot    = 0U;
static volatile uint32_t calRuntimeSaveFlags   = 0U;
static uint32_t calRuntimeSaveSeqSeen = 0U;

//
// Pending per-slot state writes, one flag per slot rather than a bitmask:
// the flags are set from interrupts and cleared from the idle loop, and
// distinct array elements cannot lose each other's updates the way a
// read-modify-write on a shared word can.
//
static volatile uint16_t stateSavePending[NUM_CHANNELS];

static void stateSaveRequestAll(void)
{
    uint16_t ch;
    for (ch = 0; ch < NUM_CHANNELS; ch++) {
        stateSavePending[ch] = 1U;
    }
}

//
// Cleared until loadSlotStates() has run and CPU1 has acted on the restore.
// Without it the first mirror pass sees every slot's status change from the
// power-up contents of the message RAM, and writes that over eight valid
// records before the restore has been applied.
//
static volatile uint16_t stateSaveArmed = 0U;

//
// Mirrors the measurements and status CPU1 published in CPU1TOCPU2RAM into
// the register file, so the external interfaces see current data. The seq
// counter is even and unchanged across a consistent snapshot.
//
static void mirrorCpu1Status(void)
{
    uint32_t seqBefore;
    uint32_t statusBits[NUM_CHANNELS];
    float32_t cellV[NUM_CHANNELS];
    float32_t cellI[NUM_CHANNELS];
    float32_t senseV[NUM_CHANNELS];
    float32_t senseI[NUM_CHANNELS];
    float32_t chgMah[NUM_CHANNELS];
    float32_t chgMwh[NUM_CHANNELS];
    float32_t chgSec[NUM_CHANNELS];
    float32_t dchMah[NUM_CHANNELS];
    float32_t dchMwh[NUM_CHANNELS];
    float32_t dchSec[NUM_CHANNELS];
    float32_t calTelemetry[8];
    float32_t calComputed[BTS_CAL_REGS_PER_CH];
    uint32_t calActiveSlot;
    uint32_t calStatus;
    uint32_t calResult;
    uint32_t calSaveSeq;
    uint32_t calSaveSlot;
    uint32_t calSaveFlags;
    float32_t inputV;
    uint32_t unitState;
    uint32_t tripStatus;
    uint32_t strapsValid;
    uint32_t slotMode;
    uint32_t slotEnable;
    uint32_t groupSize;
    uint16_t ch;
    uint16_t i;
    uint16_t attempts = 0;
    uint16_t restoreDone;

    //
    // Until CPU1 has acknowledged the boot restore its accumulators are
    // still zero, and mirroring them would erase the counters loadSlotStates()
    // just put in the register file - which is exactly what CPU1 is about to
    // read them back from. Hold the counter mirror off until the handshake
    // completes; everything else mirrors from the first pass.
    //
    restoreDone = IPC_isFlagBusyLtoR(IPC_CPU2_L_CPU1_R,
                                     BTS_IPC_FLAG_STATE_RESTORE) ? 0U : 1U;

    do {
        seqBefore = cpu1Status.seq;
        if (seqBefore & 1U) {
            continue;   // CPU1 is mid-update
        }
        for (ch = 0; ch < NUM_CHANNELS; ch++) {
            statusBits[ch] = cpu1Status.statusBits[ch];
            cellV[ch] = cpu1Status.cellVoltage[ch];
            cellI[ch] = cpu1Status.cellCurrent[ch];
            senseV[ch] = cpu1Status.senseVoltage[ch];
            senseI[ch] = cpu1Status.senseCurrent[ch];
            chgMah[ch] = cpu1Status.chargeMah[ch];
            chgMwh[ch] = cpu1Status.chargeMwh[ch];
            chgSec[ch] = cpu1Status.chargeSeconds[ch];
            dchMah[ch] = cpu1Status.dischargeMah[ch];
            dchMwh[ch] = cpu1Status.dischargeMwh[ch];
            dchSec[ch] = cpu1Status.dischargeSeconds[ch];
        }
        for (i = 0; i < 8U; i++) {
            calTelemetry[i] = cpu1Status.calTelemetry[i];
        }
        for (i = 0; i < BTS_CAL_REGS_PER_CH; i++) {
            calComputed[i] = cpu1Status.calComputed[i];
        }
        calActiveSlot = cpu1Status.calActiveSlot;
        calStatus     = cpu1Status.calStatus;
        calResult     = cpu1Status.calResult;
        calSaveSeq    = cpu1Status.calSaveSeq;
        calSaveSlot   = cpu1Status.calSaveSlot;
        calSaveFlags  = cpu1Status.calSaveFlags;
        inputV     = cpu1Status.inputVoltage;
        unitState  = cpu1Status.unitState;
        tripStatus = cpu1Status.tripStatus;
        strapsValid = cpu1Status.strapsValid;
        slotMode    = cpu1Status.slotMode;
        slotEnable  = cpu1Status.slotEnable;
        groupSize   = cpu1Status.groupSize;
    } while (cpu1Status.seq != seqBefore && ++attempts < 4U);

    if (attempts >= 4U) {
        return;   // could not get a clean snapshot; try again next tick
    }

    for (ch = 0; ch < NUM_CHANNELS; ch++) {
        uint16_t rtBase = BTS_RT_BASE(ch);

        //
        // A state transition is due a save. Detected from the mirrored status
        // word rather than from a mode write, for two reasons: the bits here
        // are the ones that will be saved, whereas a mode write is seen
        // before CPU1 has acted on it; and a transition CPU1 made on its own
        // - a trip, a termination, a watchdog pause - has no host write to
        // hang off at all.
        //
        {
            static uint32_t lastSavedBits[NUM_CHANNELS];
            uint32_t stateBits = statusBits[ch] &
                ((1UL << BTS_STATUS_RUNNING)  | (1UL << BTS_STATUS_STOPPED) |
                 (1UL << BTS_STATUS_CHARGING) | (1UL << BTS_STATUS_DISCHARGING) |
                 (1UL << BTS_STATUS_PAUSED)   | (1UL << BTS_STATUS_END));

            if (stateBits != lastSavedBits[ch]) {
                lastSavedBits[ch] = stateBits;
                if (stateSaveArmed) {
                    stateSavePending[ch] = 1U;
                }
            }
        }

        registers[rtBase + BTS_RT_STATUS]        = (float32_t)statusBits[ch];
        registers[rtBase + BTS_RT_CELL_VOLTAGE]  = cellV[ch];
        registers[rtBase + BTS_RT_CELL_CURRENT]  = cellI[ch];
        registers[rtBase + BTS_RT_SENSE_VOLTAGE] = senseV[ch];
        registers[rtBase + BTS_RT_SENSE_CURRENT] = senseI[ch];
        if (restoreDone) {
            registers[rtBase + BTS_RT_CHARGE_MAH]    = chgMah[ch];
            registers[rtBase + BTS_RT_CHARGE_MWH]    = chgMwh[ch];
            registers[rtBase + BTS_RT_CHARGE_SECONDS] = chgSec[ch];
            registers[rtBase + BTS_RT_DISCHARGE_MAH] = dchMah[ch];
            registers[rtBase + BTS_RT_DISCHARGE_MWH] = dchMwh[ch];
            registers[rtBase + BTS_RT_DISCHARGE_SECONDS] = dchSec[ch];
        }
        //
        // BTS_RT_CELL_TEMP is deliberately not touched: the ADS1119
        // converters are on this core's I2CB, so the temperature register is
        // written directly by publishCellTemp() and has no CPU1 source to
        // mirror from.
        //
    }

