ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
    registers[BTS_REG_IDX(eInputVoltage)] = inputV;
    registers[BTS_REG_IDX(eUnitState)]    = (float32_t)unitState;
    registers[BTS_REG_IDX(eTripStatus)]   = (float32_t)tripStatus;

    //
    // Calibration window. Bit 7 (written to F-RAM) is owned by this side, so
    // it is OR-ed back over whatever CPU1 published rather than overwritten.
    //
    registers[BTS_REG_IDX(eCalSlot)]   = (float32_t)calActiveSlot;
    registers[BTS_REG_IDX(eCalStatus)] = (float32_t)(calStatus |
        ((uint32_t)registers[BTS_REG_IDX(eCalStatus)] & (1UL << BTS_CAL_ST_SAVED)));
    registers[BTS_REG_IDX(eCalResult)] = (float32_t)calResult;

    for (i = 0; i < 8U; i++) {
        registers[BTS_REG_IDX(eCalAdsV_pu) + i] = calTelemetry[i];
    }
    //
    // The cell temperature is this side's: the ADS1119 converters are on
    // CPU2's I2CB, so CPU1 has no reading to publish.
    //
    registers[BTS_REG_IDX(eCalTemp_C)] = (calActiveSlot < NUM_CHANNELS)
                                       ? registers[BTS_CELLTEMP_IDX((uint16_t)calActiveSlot)]
                                       : 0.0f;

    //
    // A new computed result. Stage it into the register file here - that is
    // CPU2-owned memory and cheap - but leave the F-RAM write to the idle
    // loop.
    //
    if ((calSaveSeq != calRuntimeSaveSeqSeen) && (calSaveSlot < NUM_CHANNELS)) {
        uint16_t calBase = BTS_CAL_BASE((uint16_t)calSaveSlot);

        calRuntimeSaveSeqSeen = calSaveSeq;
        for (i = 0; i < BTS_CAL_REGS_PER_CH; i++) {
            registers[calBase + i] = calComputed[i];
        }
        calRuntimeSaveSlot    = (uint16_t)calSaveSlot;
        calRuntimeSaveFlags   = calSaveFlags;
        calRuntimeSavePending = 1U;
    }

    //
    // Dip-switch straps. Only published once CPU1 says it has latched
    // them - the two cores boot independently, and this message RAM is
    // NOLOAD from CPU2's side, so before that the values are whatever the
    // RAM powered up holding.
    //
    if (strapsValid != 0U) {
        registers[BTS_REG_IDX(eSlotMode)]   = (float32_t)slotMode;
        registers[BTS_REG_IDX(eSlotEnable)] = (float32_t)slotEnable;
        registers[BTS_REG_IDX(eGroupSize)]  = (float32_t)groupSize;
    }
}

static volatile uint16_t canTxChannel = 0;

//
//=============================================================================
// Host watchdog and state-save scheduling
//=============================================================================
//
// CPU Timer 1 runs at 8 Hz (DEVICE_SYSCLK_FREQ / 8 period), which is the
// timebase for both. Derived rather than written out so a change to the timer
// period carries into the seconds arithmetic.
//
#define BTS_TIMER_TICKS_PER_S  8U
#define BTS_STATE_SAVE_PERIOD_S 6U

//
// The eight slots are staggered one per tick across the 6 s window rather
// than written in one pass, so a save never holds the I2C controller - and
// therefore the host bus - for eight transfers at once.
//
#define BTS_STATE_SAVE_TICKS   (BTS_STATE_SAVE_PERIOD_S * BTS_TIMER_TICKS_PER_S)

static volatile uint16_t hostWdTicks = 0U;
static volatile uint16_t hostWdRemaining_s = 0U;
static volatile uint16_t hostWdExpired = 0U;

//
// Set when a host disables the watchdog. The warning is printed from the
// idle loop, not from the interrupt the write arrives in - uartSendResponse()
// blocks per character and would hold off the host mid-transaction.
//
static volatile uint16_t hostWdDisableWarn = 0U;

//
// Reloads the host watchdog. Called from exactly one place per interface:
// applyHostRegisterWrite() covers the I2C, UART and CAN write paths, and
// i2cSlaveFifoISR()'s transmit path covers an I2C read.
//
// A polling host proves it is alive by reading, so a read must reload too -
// the ESP32's steady state is reads only, and without this the watchdog
// would pause every slot 30 s after the last mode command while the link was
// perfectly healthy.
//
static void hostWatchdogFeed(void)
{
    uint16_t timeout = (uint16_t)registers[BTS_REG_IDX(eHostWatchdog_s)];

    //
    // Remaining before expired: the 8 Hz tick can land between these two
    // writes, and in that order it sees the stale expired flag and returns
    // rather than counting down from a half-reloaded zero.
    //
    hostWdTicks       = 0U;
    hostWdRemaining_s = timeout;
    hostWdExpired     = 0U;
}

//
// One 8 Hz tick of the countdown. Never touches slot control state - it only
// bumps supervision.wdPauseSeq, and CPU1 performs the pause.
//
static void hostWatchdogTick(void)
{
    uint16_t timeout = (uint16_t)registers[BTS_REG_IDX(eHostWatchdog_s)];

    if (timeout == 0U) {
        //
        // Disabled. Zero remaining, so a host reading the countdown beside
        // the timeout can tell "disabled" from "fired".
        //
        hostWdTicks       = 0U;
        hostWdRemaining_s = 0U;
        registers[BTS_REG_IDX(eWatchdogRemaining_s)] = 0.0f;
        return;
    }

    if (hostWdExpired) {
        registers[BTS_REG_IDX(eWatchdogRemaining_s)] = 0.0f;
        return;
    }

    if (++hostWdTicks < BTS_TIMER_TICKS_PER_S) {
        return;
    }
    hostWdTicks = 0U;

    if (hostWdRemaining_s > timeout) {
        hostWdRemaining_s = timeout;   // the host shortened the timeout
    }

    if (hostWdRemaining_s > 0U) {
        hostWdRemaining_s--;
    }
    registers[BTS_REG_IDX(eWatchdogRemaining_s)] = (float32_t)hostWdRemaining_s;

    if (hostWdRemaining_s == 0U) {
        hostWdExpired = 1U;
        supervision.wdPauseSeq++;
        //
        // A pause is a state transition, so every slot's record is due.
        //
        stateSaveRequestAll();
    }
}

#pragma CODE_SECTION(timerISR, "isrcodefuncs")
#pragma INTERRUPT(timerISR, HPI)
__interrupt void timerISR(void)
{
    static uint16_t stateSaveTick = 0U;

    mirrorCpu1Status();
    hostWatchdogTick();

    //
    // One slot marked per tick: eight slots spread across the 6 s window.
    // Armed only once CPU1 has acknowledged the boot restore, so a periodic
    // save cannot overwrite a record before it has been applied.
    //
    if (!stateSaveArmed) {
        if (!IPC_isFlagBusyLtoR(IPC_CPU2_L_CPU1_R, BTS_IPC_FLAG_STATE_RESTORE)) {
            stateSaveArmed = 1U;
        }
    } else {
        if (++stateSaveTick >= BTS_STATE_SAVE_TICKS) {
            stateSaveTick = 0U;
        }
        if (stateSaveTick < NUM_CHANNELS) {
            stateSavePending[stateSaveTick] = 1U;
        }
    }

    sendCANData(canTxChannel);
    canTxChannel = (canTxChannel + 1) % NUM_CHANNELS;
    CPUTimer_clearOverflowFlag(CPUTIMER1_BASE);
    //
    // CPU Timer 1 is connected directly to CPU INT13, not through the PIE,
    // so there is no acknowledge group to clear.
    //
}

//
// Target-side command parser state.
//
// A host command is two address bytes followed by either data (a write) or a
// repeated start and a read. Tracking that as an explicit phase rather than a
// byte counter keeps the receive and transmit sides from sharing a counter -
// they previously did, and the read path then skipped its own first step and
// served whatever the buffer still held.
//
typedef enum {
    eI2cAddrHi = 0,     // waiting for the high address byte
    eI2cAddrLo,         // waiting for the low address byte
    eI2cData,           // address complete; any further bytes are payload
} BTS_i2cRxPhase;

static volatile BTS_i2cRxPhase rxPhase   = eI2cAddrHi;
static volatile uint16_t       rxDataIdx = 0;

