ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
volatile uint16_t currentRegAddr = 0;
volatile uint32_t dbgSlaveIsr = 0;
volatile uint32_t dbgSlaveAddr = 0;
volatile uint32_t dbgSlaveRx = 0;
volatile uint32_t dbgSlaveTx = 0;
volatile uint32_t dbgSlaveErr = 0;
volatile uint32_t dbgSlaveStuck = 0;
volatile uint16_t dbgRxSeq[8] = {0,0,0,0,0,0,0,0};
volatile uint16_t dbgRxIdx = 0;
volatile uint16_t dbgBcAtRx[8] = {0,0,0,0,0,0,0,0};
volatile uint16_t dbgLastReg = 0;
static volatile uint16_t aasPrev = 0;
static volatile uint16_t dirPrev = 0;
//
// Transmit-side byte counter, separate from byteCount which tracks the
// receive phase. A register read uses both: two bytes in, four out.
//
static volatile uint16_t txCount = 0;
volatile float tempData = 0.0f;
volatile uint16_t isWrite = 0;
static uint16_t readBuffer[4] = {0};
static volatile uint16_t bufferValid = 0;

//
// Applies a host register write from any interface (I2C, UART or CAN).
// Writes the register file, notifies CPU1, and handles the eCalibrationMode
// commit trigger.
//
//
// Set when a host asks for a calibration commit. The save writes the
// whole image to the F-RAM, far too long to run inside the I2C slave
// interrupt where the request arrives - doing so held off the host
// mid-transaction. Recorded here, carried out from the idle loop.
//
static volatile uint16_t calibrationSavePending = 0U;

static void applyHostRegisterWrite(uint16_t regIdx, float32_t value)
{
    registers[regIdx] = value;
    notifyCpu1RegisterWrite(regIdx, value);

    //
    // The reload hook for all three write paths: I2C target, UART AT and CAN
    // all funnel through here. The I2C read path has its own hook in
    // i2cSlaveFifoISR().
    //
    hostWatchdogFeed();

    if (regIdx == BTS_REG_IDX(eHostWatchdog_s)) {
        //
        // Disabling supervision on a machine that charges lithium cells
        // unattended is worth saying out loud - it is a legitimate bench
        // setting and a dangerous production one. Printed from the idle
        // loop; this runs inside an interrupt.
        //
        if (value == 0.0f) {
            hostWdDisableWarn = 1U;
        }
    }

    if (regIdx == BTS_REG_IDX(eCalibrationMode) && value == 2.0f) {
        calibrationSavePending = 1U;
    }

    //
    // A calibration command is consumed on write. Self-clearing here rather
    // than waiting for CPU1 means a host polling eCalCommand sees 0 as soon
    // as the write is accepted; the opcode itself already travelled to CPU1
    // in the IPC payload, so clearing the register cannot lose it.
    //
    if ((regIdx == BTS_REG_IDX(eCalCommand)) && (value != 0.0f)) {
        registers[regIdx] = 0.0f;
        //
        // A fresh command supersedes any previous save indication.
        //
        registers[BTS_REG_IDX(eCalStatus)] =
            (float32_t)((uint32_t)registers[BTS_REG_IDX(eCalStatus)] &
                        ~(1UL << BTS_CAL_ST_SAVED));
    }
}

//
// Runs work that interrupt handlers deferred. Called from the idle
// loop, where a long F-RAM transfer costs nothing.
//
//
// Recovers the host-facing I2C target if it locks up.
//
// A target that is interrupted mid-byte - the host resetting, a cable pulled,
// a transfer abandoned on timeout - can be left holding SCL low with BUS_BUSY
// set and no interrupt pending to service. Nothing on this side clears that:
// the ISR only runs when the module asks it to, and a wedged module never
// asks. The bus then stays jammed for every device on it, and the host reports
// the unit as absent.
//
// Watch for BUS_BUSY that persists with no address match, and reinitialise
// the module through its reset bit when it does.
//
static void serviceI2CTargetWatchdog(void)
{
    static uint32_t busyPasses;
    static uint32_t lastAddrCount;

    //
    // Any address activity means the target is alive and talking; the bus
    // being busy is then just a transfer in progress.
    //
    if (dbgSlaveAddr != lastAddrCount) {
        lastAddrCount = dbgSlaveAddr;
        busyPasses = 0U;
        return;
    }

    if ((I2C_getStatus(I2CA_BASE) & I2C_STS_BUS_BUSY) == 0U) {
        busyPasses = 0U;
        return;
    }

    if (++busyPasses < BTS_I2C_TARGET_STUCK_PASSES) {
        return;
    }

    //
    // Busy for a long time with nothing happening: the module is stuck, not
    // working. Reset it and re-arm as a target.
    //
    busyPasses = 0U;
    dbgSlaveStuck++;

    //
    // A full peripheral reset, not just the module reset bit.
    //
    // Clearing IRS releases SCL, but the module comes straight back up
    // still believing it is an addressed target transmitter - TARGET_DIR
    // stays set - and clamps the clock again waiting to send a byte for
    // a transaction that no longer exists. Writing I2CDXR does not clear
    // it either. Only a reset through the system controller drops that
    // latched state.
    //
    I2C_disableModule(I2CA_BASE);
    SysCtl_resetPeripheral(SYSCTL_PERIPH_RES_I2CA);
    SysCtl_delay(100U);

    I2C_initController(I2CA_BASE, DEVICE_SYSCLK_FREQ, 100000, I2C_DUTYCYCLE_50);
    I2C_setConfig(I2CA_BASE, I2C_TARGET_RECEIVE_MODE);
    I2C_setOwnAddress(I2CA_BASE, BTS_I2C_TARGET_ADDRESS);
    I2C_disableLoopback(I2CA_BASE);
    I2C_setBitCount(I2CA_BASE, I2C_BITCOUNT_8);
    I2C_setDataCount(I2CA_BASE, 2);
    I2C_setAddressMode(I2CA_BASE, I2C_ADDR_MODE_7BITS);
    I2C_enableFIFO(I2CA_BASE);

    I2C_clearInterruptStatus(I2CA_BASE,
                             I2C_INT_ADDR_TARGET | I2C_INT_ARB_LOST |
                             I2C_INT_NO_ACK | I2C_INT_STOP_CONDITION |
                             I2C_INT_RXFF | I2C_INT_TXFF);

    I2C_setFIFOInterruptLevel(I2CA_BASE, I2C_FIFO_TXEMPTY, I2C_FIFO_RX1);

    I2C_setFIFOInterruptLevel(I2CA_BASE, I2C_FIFO_TXEMPTY, I2C_FIFO_RX1);

    I2C_enableInterrupt(I2CA_BASE,
                        I2C_INT_ADDR_TARGET | I2C_INT_ARB_LOST |
                        I2C_INT_NO_ACK | I2C_INT_STOP_CONDITION |
                        I2C_INT_RXFF | I2C_INT_TXFF);

    I2C_setEmulationMode(I2CA_BASE, I2C_EMULATION_FREE_RUN);
    I2C_enableModule(I2CA_BASE);

    rxPhase        = eI2cAddrHi;
    rxDataIdx      = 0;
    txCount        = 0;
    aasPrev        = 0;
    bufferValid    = 0;
    currentRegAddr = 0;
    tempData       = 0.0f;
}

