ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
/*
 * CPU 2 Main Routine
 *
 * Boot order matters: the peripherals that reach the EEPROM come up first,
 * then loadCalibration() populates the register file from EEPROM (or from
 * defaults) and notifies CPU1 to recalculate and run. Interrupts are only
 * enabled once that initial register file is in place, so a host write can
 * never race the boot-time load.
 */
void main(void)
{
    Device_init();
    Device_initGPIO();
    Interrupt_initModule();
    Interrupt_initVectorTable();

    initI2C_Master();

    //
    // Establish the register file before anything can observe or modify it.
    //
    loadCalibration();

    //
    // Slot runtime state, after the calibration load so the whole register
    // file settles before either IPC flag goes up.
    //
    loadSlotStates();

    initI2C_Slave();
    initUART();
    initCAN();
    initTimer();
    LEDDriver_init();

    EINT;
    ERTM;

    //
    // Boot banner - confirms init completed and the console is alive.
    // Printed before any interrupt-driven work so it still appears if a
    // peripheral on the I2C bus is absent or misbehaving.
    //
#if (BTS_CONSOLE_ENABLED == true)
    uartSendResponse("");
    uartSendResponse("BTS F2837xD CPU2 ready");
    {
        char line[48];
        formatRegisterValue(line, sizeof(line), "ChargeDisableV",
                            registers[BTS_REG_IDX(eChargeDisableV)]);
        uartSendResponse(line);
        formatRegisterValue(line, sizeof(line), "Ch0_F28V_Gain",
                            registers[BTS_CAL_BASE(0) + BTS_CAL_F28V_GAIN]);
        uartSendResponse(line);
    }
    uartSendResponse("OK");
#endif

    //
    // Temperature acquisition last: its DRDY ISRs drive the I2CB bus, so the
    // console and the register interfaces are already up before they start.
    // If a converter is absent the bounded I2C helpers simply time out.
    //
    initADS1119();

    while (1) {
        //
        // Background work. Both perform at most one short, non-blocking
        // step per pass, so the console, the I2CA slave and CAN stay
        // responsive while I2CB is driven continuously.
        //
        BTS_serviceADS1119();
        BTS_serviceDeferredWork();
    }
}

#endif
